; domain
(define (domain blocksworld)
    (:requirements :typing)
    (:types block robot)
    (:predicates 
        (on ?x - block ?y - block) ; observed predicate
        (ontable ?x - block)  ; derived predicate
        (clear ?x - block)  ; derived predicate
        (handempty ?x - robot)  ; derived predicate
        (handfull ?x - robot)  ; derived predicate
        (holding ?x - block) ; derived predicate
    )
    (:action pick_up
        :parameters (?x - block ?robot - robot)
        :precondition (and
            (clear ?x) 
            (ontable ?x) 
            (handempty ?robot)
        )
        :effect (and
            (not (ontable ?x))
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (holding ?x)
        )
    )
    (:action put_down
        :parameters (?x - block ?robot - robot)
        :precondition (and 
            (holding ?x)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (ontable ?x))
        )
    (:action stack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (holding ?x) 
            (clear ?y)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (on ?x ?y)
        )
    )
    (:action unstack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (on ?x ?y)
            (clear ?x)
            (handempty ?robot)
        )
        :effect (and 
            (holding ?x)
            (clear ?y)
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (not (on ?x ?y))
        )
    )
)

; problem
(define (problem blocksworld5)
(:domain blocksworld)
(:objects
    green_block - block 
    blue_block - block 
    arm - robot 
    yellow_block - block 
    orange_block - block 
    red_block - block 
)

(:init
    ( clear green_block )
    ( handempty arm )
    ( on blue_block red_block )
    ( on green_block orange_block )
    ( on orange_block blue_block )
    ( on red_block yellow_block )
    ( ontable yellow_block )
)

(:goal (and (on yellow_block red_block) (on red_block blue_block) (on blue_block orange_block) (on orange_block green_block) (clear yellow_block)))
)

; plan
1. (unstack green_block orange_block arm)
   deleted: (clear green_block) (handempty arm) (on green_block orange_block)
   added: (holding green_block) (clear orange_block) (handfull arm)
   goals met: 0 of 5
2. (put_down green_block arm)
   deleted: (holding green_block) (handfull arm)
   added: (clear green_block) (handempty arm) (ontable green_block)
   goals met: 0 of 5
3. (unstack orange_block blue_block arm)
   deleted: (clear orange_block) (handempty arm) (on orange_block blue_block)
   added: (holding orange_block) (clear blue_block) (handfull arm)
   goals met: 0 of 5
4. (stack orange_block green_block arm)
   deleted: (holding orange_block) (clear green_block) (handfull arm)
   added: (clear orange_block) (handempty arm) (on orange_block green_block)
   goals met: 1 of 5
5. (unstack blue_block red_block arm)
   deleted: (clear blue_block) (handempty arm) (on blue_block red_block)
   added: (holding blue_block) (clear red_block) (handfull arm)
   goals met: 1 of 5
6. (stack blue_block orange_block arm)
   deleted: (holding blue_block) (clear orange_block) (handfull arm)
   added: (clear blue_block) (handempty arm) (on blue_block orange_block)
   goals met: 2 of 5
7. (unstack red_block yellow_block arm)
   deleted: (clear red_block) (handempty arm) (on red_block yellow_block)
   added: (holding red_block) (clear yellow_block) (handfull arm)
   goals met: 3 of 5
8. (stack red_block blue_block arm)
   deleted: (holding red_block) (clear blue_block) (handfull arm)
   added: (clear red_block) (handempty arm) (on red_block blue_block)
   goals met: 4 of 5
9. (pick_up yellow_block arm)
   deleted: (ontable yellow_block) (clear yellow_block) (handempty arm)
   added: (handfull arm) (holding yellow_block)
   goals met: 3 of 5
10. (stack yellow_block red_block arm)
   deleted: (holding yellow_block) (clear red_block) (handfull arm)
   added: (clear yellow_block) (handempty arm) (on yellow_block red_block)
   goals met: 5 of 5
